tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "ansible"
brew "bat"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "python"
brew "terraform"
brew "tflint"

cask "authy"
cask "docker"
cask "google-chrome"
cask "paw"
cask "private-internet-access"
cask "spotify"
cask "visual-studio-code"

# NerdFonts
cask "font-hack-nerd-font"

# Quick Look plugins
cask "qlcolorcode"          # Syntax highlighting for source code files
cask "qlstephen"            # Preview plain text files with or without known file extension e.g. README
cask "qlmarkdown"           # Markdown file preview
cask "quicklook-json"       # JSON, of course
cask "qlimagesize"          # Show image size and resolution in preview
cask "suspicious-packge"    # Show contents of a standard apple installer package
cask "qlvideo"              # Preview video with thumbnaisl, cover art and metadata

# Mac Store Apps
mas "1Password", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Cyberduck", id: 409222199
mas "EyeFriendly", id: 587769990
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
